<a href="https://colab.research.google.com/github/Divyanshu-ISM/Oil-and-Gas-data-analysis/blob/master/GL_pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv('Uber Drives 2016.csv')

In [ ]:
df.head()

      START_DATE*       END_DATE*  ... MILES*         PURPOSE*
0  1/1/2016 21:11  1/1/2016 21:17  ...    5.1   Meal/Entertain
1   1/2/2016 1:25   1/2/2016 1:37  ...    5.0              NaN
2  1/2/2016 20:25  1/2/2016 20:38  ...    4.8  Errand/Supplies
3  1/5/2016 17:31  1/5/2016 17:45  ...    4.7          Meeting
4  1/6/2016 14:42  1/6/2016 15:49  ...   63.7   Customer Visit

[5 rows x 7 columns]

In [ ]:
type(df['STOP*']) #you can see that each column is a series.

pandas.core.series.Series

In [ ]:
# df.head()
df.shape

(1156, 7)

In [ ]:
df.tail()

           START_DATE*         END_DATE*  ...   MILES*        PURPOSE*
1151  12/31/2016 13:24  12/31/2016 13:42  ...      3.9  Temporary Site
1152  12/31/2016 15:03  12/31/2016 15:38  ...     16.2         Meeting
1153  12/31/2016 21:32  12/31/2016 21:50  ...      6.4  Temporary Site
1154  12/31/2016 22:08  12/31/2016 23:51  ...     48.2  Temporary Site
1155            Totals               NaN  ...  12204.7             NaN

[5 rows x 7 columns]

In [ ]:
#NaN means not any number. 
#OFFICIAL Junk character of pandas.

In [ ]:
df.dtypes
#so you can see that by default every date that a pandas reads is a string(object).
#to make it usable and manipulate-able - we have to convert it into a Date Type object.

START_DATE*     object
END_DATE*       object
CATEGORY*       object
START*          object
STOP*           object
MILES*         float64
PURPOSE*        object
dtype: object

In [ ]:
temp = pd.DataFrame({'A':['1','2','3'], 'B':['11', '12', '13'] , 'C':['12-06-2012', '12-07-2012', '13-08-2012']})

In [ ]:
temp

   A   B           C
0  1  11  12-06-2012
1  2  12  12-07-2012
2  3  13  13-08-2012

In [ ]:
pd.to_datetime('june-2016-2')

Timestamp('2016-06-02 00:00:00')

In [ ]:
pd.to_datetime('2-june-2016')

Timestamp('2016-06-02 00:00:00')

In [ ]:
# pd.to_datetime('2-2016-06') error. Gets confused what's what

By default the pd.to_datetime expects the Y-M-D format. 
You can change the format using datetime library's format method.

In [ ]:
temp['C'] = pd.to_datetime(temp['C'])

In [ ]:
# type(temp['C'][0]) #pandas._libs.tslibs.timestamps.Timestamp
temp

   A   B          C
0  1  11 2012-12-06
1  2  12 2012-12-07
2  3  13 2012-08-13

#Note- 
If you want to convert all dates to date-time format and just ignore the few ones that cannot be converted (by writing NaT not any time) you can use - 

pd.to_datetime(df['datecolumn'] , errors = 'coerce')

In [ ]:
temp

   A   B          C
0  1  11 2012-12-06
1  2  12 2012-12-07
2  3  13 2012-08-13

In [ ]:
# Now here 
type(temp['A'][0]) #But we want it in numeric form.

str

##pd.to_numeric

In [ ]:
temp['A'] = pd.to_numeric(temp['A'])

In [ ]:
type(temp['A'][0]) ## str-----> numpy.int64 brilliant!

numpy.int64

# df['colname'].value_counts()

In [ ]:
df['START*'].value_counts() #returns the unique start* points and then finds the # of rows corresponding to each.

Cary                   201
Unknown Location       148
Morrisville             85
Whitebridge             68
Islamabad               57
                      ...
Fuquay-Varina            1
Red River District       1
Arabi                    1
University District      1
Washington               1
Name: START*, Length: 177, dtype: int64

In [ ]:
df['START*'].value_counts().head() #TOP 5 starting points (with the most trips).

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Name: START*, dtype: int64

In [ ]:
df['START*'].value_counts().tail() #least tripped starting points.

Fuquay-Varina          1
Red River District     1
Arabi                  1
University District    1
Washington             1
Name: START*, dtype: int64

#Common Data Manipulation Tasks

5 Verbs of Data MAnipulation-

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/Conditionally adding columns.
5. Groupby/Summarize.

Just to Add to this : colname.apply(functions)

In [ ]:
##### LEt's Practice This #####

1. Selecting/ Indexing -


*   df['column_name']
*   df.iloc[0:5 , 1:4]
*   df.loc[....]

In [ ]:
df.iloc[0:5 , 0:5]

      START_DATE*       END_DATE* CATEGORY*       START*            STOP*
0  1/1/2016 21:11  1/1/2016 21:17  Business  Fort Pierce      Fort Pierce
1   1/2/2016 1:25   1/2/2016 1:37  Business  Fort Pierce      Fort Pierce
2  1/2/2016 20:25  1/2/2016 20:38  Business  Fort Pierce      Fort Pierce
3  1/5/2016 17:31  1/5/2016 17:45  Business  Fort Pierce      Fort Pierce
4  1/6/2016 14:42  1/6/2016 15:49  Business  Fort Pierce  West Palm Beach

In [ ]:
df.iloc[0:5 , [1,2]]

        END_DATE* CATEGORY*
0  1/1/2016 21:17  Business
1   1/2/2016 1:37  Business
2  1/2/2016 20:38  Business
3  1/5/2016 17:45  Business
4  1/6/2016 15:49  Business

In [ ]:
df.iloc[[1,4], [2,5]]

  CATEGORY*  MILES*
1  Business     5.0
4  Business    63.7

In [ ]:
df.iloc[0:4,:]

      START_DATE*       END_DATE*  ... MILES*         PURPOSE*
0  1/1/2016 21:11  1/1/2016 21:17  ...    5.1   Meal/Entertain
1   1/2/2016 1:25   1/2/2016 1:37  ...    5.0              NaN
2  1/2/2016 20:25  1/2/2016 20:38  ...    4.8  Errand/Supplies
3  1/5/2016 17:31  1/5/2016 17:45  ...    4.7          Meeting

[4 rows x 7 columns]

In [ ]:
df.iloc[0:4]

      START_DATE*       END_DATE*  ... MILES*         PURPOSE*
0  1/1/2016 21:11  1/1/2016 21:17  ...    5.1   Meal/Entertain
1   1/2/2016 1:25   1/2/2016 1:37  ...    5.0              NaN
2  1/2/2016 20:25  1/2/2016 20:38  ...    4.8  Errand/Supplies
3  1/5/2016 17:31  1/5/2016 17:45  ...    4.7          Meeting

[4 rows x 7 columns]

##Filtering Columns

*  skeleton for filtering df[ ]
*  If you pass it as a string - df['col1'] -> returns a series
*  If you pass it as a list - df[['col1']] -> returns a DF

##Excercise : Extract 1st 5 rows and START* and MILES* columns

In [ ]:
df.loc[0:4 , ['START*','MILES*']] #could have done .head() but this what I have done is standard practice. 

#df.loc[0:4] -> Both 0 and 4 are included.

        START*  MILES*
0  Fort Pierce     5.1
1  Fort Pierce     5.0
2  Fort Pierce     4.8
3  Fort Pierce     4.7
4  Fort Pierce    63.7

In [ ]:
# df.iloc[0:4 , [3,5]] #iloc doesn't include the last row in 0:4. so we gotta provide one extra. 
df.iloc[0:5 , [3,5]]

        START*  MILES*
0  Fort Pierce     5.1
1  Fort Pierce     5.0
2  Fort Pierce     4.8
3  Fort Pierce     4.7
4  Fort Pierce    63.7

In [ ]:
my_rides =df.loc[df['START*'].isin(['Cary','Morrisville'])]

In [ ]:
my_rides.head(n=10) #you can see that the indices are not updated. 

my_rides.reset_index()

     index       START_DATE*  ... MILES*         PURPOSE*
0        7    1/7/2016 13:27  ...    0.8          Meeting
1        8    1/10/2016 8:05  ...    8.3          Meeting
2       27    1/15/2016 0:41  ...    8.0  Errand/Supplies
3       28   1/15/2016 11:43  ...   10.4   Meal/Entertain
4       30   1/18/2016 14:55  ...    4.8   Meal/Entertain
..     ...               ...  ...    ...              ...
281   1050  12/14/2016 16:52  ...    3.4              NaN
282   1051  12/14/2016 17:22  ...    3.3              NaN
283   1052  12/14/2016 17:50  ...    3.0   Meal/Entertain
284   1053  12/14/2016 20:24  ...    3.1   Customer Visit
285   1054  12/15/2016 14:20  ...   10.6          Meeting

[286 rows x 8 columns]

#FILTERING

Q. Find all trips with distance > 10 miles and originating from Carry and Morrisville.

In [ ]:
# df.head()
q1 = df[(df['MILES*']>10.0) & (df['START*'].isin(['Cary','Morrisville']))]
q1.head()

        START_DATE*        END_DATE* CATEGORY*  ...    STOP* MILES*        PURPOSE*
28  1/15/2016 11:43  1/15/2016 12:03  Business  ...   Durham   10.4  Meal/Entertain
34  1/20/2016 10:36  1/20/2016 11:11  Business  ...  Raleigh   17.1         Meeting
46  1/27/2016 10:19  1/27/2016 10:48  Business  ...  Raleigh   18.7  Customer Visit
50  1/28/2016 12:28  1/28/2016 13:00  Business  ...  Raleigh   19.0  Temporary Site
55  1/29/2016 11:43  1/29/2016 12:03  Business  ...   Durham   10.4         Meeting

[5 rows x 7 columns]

In [ ]:
q1.reset_index(inplace=True)

In [ ]:
q1=q1.drop('index',axis=1)

In [ ]:
q1.head(3)

       START_DATE*        END_DATE* CATEGORY*  ...    STOP* MILES*        PURPOSE*
0  1/15/2016 11:43  1/15/2016 12:03  Business  ...   Durham   10.4  Meal/Entertain
1  1/20/2016 10:36  1/20/2016 11:11  Business  ...  Raleigh   17.1         Meeting
2  1/27/2016 10:19  1/27/2016 10:48  Business  ...  Raleigh   18.7  Customer Visit

[3 rows x 7 columns]

#Sorting

1. Sorting by single column.

In [ ]:
df.sort_values(by='MILES*',ascending=False).head()

           START_DATE*         END_DATE*  ...   MILES*        PURPOSE*
1155            Totals               NaN  ...  12204.7             NaN
269    3/25/2016 16:52   3/25/2016 22:22  ...    310.3  Customer Visit
270    3/25/2016 22:54    3/26/2016 1:39  ...    201.0         Meeting
881   10/30/2016 15:22  10/30/2016 18:23  ...    195.9             NaN
776    9/27/2016 21:01    9/28/2016 2:37  ...    195.6             NaN

[5 rows x 7 columns]

2. Sorting by multiple columns.

In [ ]:
df.sort_values(by=['START*','MILES*'],ascending=[True,False]).head()

          START_DATE*         END_DATE* CATEGORY*  ...        STOP* MILES*  PURPOSE*
906   11/4/2016 21:04   11/4/2016 21:20  Business  ...         Cory    4.3       NaN
911   11/6/2016 10:50   11/6/2016 11:04  Business  ...  Renaissance    2.4       NaN
908    11/5/2016 8:34    11/5/2016 8:43  Business  ...  Renaissance    2.2       NaN
910   11/5/2016 19:20   11/5/2016 19:28  Business  ...        Agnew    2.2       NaN
879  10/30/2016 12:58  10/30/2016 13:18  Business  ...  Bryson City   15.2       NaN

[5 rows x 7 columns]

#Conditionally adding columns.

What if Miles >5 is a long trip and <5 is a short trip.

So we'll add a Miles-tag column

In [ ]:
tag = lambda mile : 'Long' if mile>5.0 else 'Short'

In [ ]:
df['Mile-Tag'] = df['MILES*'].apply(tag)

In [ ]:
df.head()

      START_DATE*       END_DATE* CATEGORY*  ... MILES*         PURPOSE*  Mile-Tag
0  1/1/2016 21:11  1/1/2016 21:17  Business  ...    5.1   Meal/Entertain      Long
1   1/2/2016 1:25   1/2/2016 1:37  Business  ...    5.0              NaN     Short
2  1/2/2016 20:25  1/2/2016 20:38  Business  ...    4.8  Errand/Supplies     Short
3  1/5/2016 17:31  1/5/2016 17:45  Business  ...    4.7          Meeting     Short
4  1/6/2016 14:42  1/6/2016 15:49  Business  ...   63.7   Customer Visit      Long

[5 rows x 8 columns]

In [ ]:
df['Mile-Tag'].value_counts() #very nice way to summarize long and short trip Nos.

Long     654
Short    502
Name: Mile-Tag, dtype: int64

In [ ]:
#Let's rather create 3 tags. 
#1. <5 - Short | 5-10 Medium | >10 Long

In [ ]:
tagger = lambda mile :